* 2017
** 2017-08 August
*** 2017-08-18 Friday
**** QQQ big lizard
     |----+-------+-------+------------------|
     | -3 |   138 | put   | <2017-08-18 Fri> |
     | -3 |   138 | call  | <2017-08-18 Fri> |
     |  3 |   144 | call  | <2017-08-18 Fri> |
     |----+-------+-------+------------------|
     |    | 18.88 | trade | <2017-05-11 Thu> |
     |----+-------+-------+------------------|
     |    | 18.88 |       |                  |
     |----+-------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
** 2017-09 September
*** 2017-09-15 Friday
**** QQQ call
     |----+-------+----------+------------------|
     | -3 |   134 | call     | <2017-09-15 Fri> |
     |----+-------+----------+------------------|
     |    |  2.88 | trade    | <2017-01-23 Mon> |
     |    |  0.28 |          | <2017-03-06 Mon> |
     |    | -0.16 | apr->may | <2017-03-16 Thu> |
     |    |  0.49 | may->aug | <2017-05-11 Thu> |
     |    |  1.68 | aug->sep | <2017-08-09 Wed> |
     |----+-------+----------+------------------|
     |    |  5.17 |          |                  |
     |----+-------+----------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
** 2017-10 October
*** 2017-10-20 Friday
**** HD call
     |----+------+----------+------------------|
     | -1 |  145 | call     | <2017-10-20 Fri> |
     |----+------+----------+------------------|
     |    | 0.64 | trade    | <2017-01-13 Fri> |
     |    | 1.19 | mar->apr | <2017-03-03 Fri> |
     |    | 1.60 | apr->may | <2017-04-03 Mon> |
     |    | 0.50 | may->jun | <2017-04-19 Wed> |
     |    | 1.41 | jun->aug | <2017-05-24 Wed> |
     |    | 0.93 | aug->oct | <2017-08-09 Wed> |
     |----+------+----------+------------------|
     |    | 6.27 |          |                  |
     |----+------+----------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** ON call
     |----+------+----------+------------------|
     | -2 |   13 | call     | <2017-10-20 Fri> |
     |----+------+----------+------------------|
     |    | 3.06 | trade    | <2016-12-29 Thu> |
     |    | 1.00 | jul->oct | <2017-06-29 Thu> |
     |----+------+----------+------------------|
     |    | 4.06 |          |                  |
     |----+------+----------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
* 2018
** 2018-02 February
*** 2018-02-16 Friday
**** ED call
     |----+------+----------+------------------|
     | -2 | 77.5 | call     | <2018-02-16 Fri> |
     |----+------+----------+------------------|
     |    | 1.88 | trade    | <2016-12-08 Thu> |
     |    | 1.94 | may->aug | <2017-04-19 Wed> |
     |    | 1.42 | aug->feb | <2017-08-09 Wed> |
     |----+------+----------+------------------|
     |    | 3.82 |          |                  |
     |----+------+----------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
